
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        3 |          13 |            1 |
## Affected resources by action

|  Action  | Resources                                                                   |
|:--------:|:----------------------------------------------------------------------------|
|    🟢    | `aws_iam_role_policy_attachment.osv-scanner-github`                         |
|    🟢    | `module.osv-scanner-github.aws_iam_role.github`                             |
|    🟡    | `module.jumphost.aws_autoscaling_group.jumphost`                            |
|    🟡    | `module.jumphost.aws_iam_policy.required`                                   |
|    🟡    | `module.jumphost.aws_launch_template.jumphost`                              |
|    🟡    | `module.mail_twindb_com.aws_autoscaling_group.postfix`                      |
|    🟡    | `module.mail_twindb_com.aws_iam_policy.required`                            |
|    🟡    | `module.mail_twindb_com.aws_launch_template.postfix`                        |
|    🟡    | `module.terraform-aws-github-backup.aws_autoscaling_group.main`             |
|    🟡    | `module.terraform-aws-github-backup.aws_launch_template.github-backup`      |
|    🟡    | `module.vpn.aws_autoscaling_group.openvpn`                                  |
|    🟡    | `module.vpn.aws_launch_template.openvpn`                                    |
|    🟡    | `module.vpn.module.instance_profile.aws_iam_policy.profile`                 |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website` |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.osv-scanner-github will be created
  + resource "aws_iam_role_policy_attachment" "osv-scanner-github" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::493370826424:policy/package-publisher"
      + role       = "ih-tf-osv-scanner-github"
    }

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20240223005113359100000009-02R7BZ"
        name                             = "jumphost-20240223005113359100000009-02R7BZ"
        # (31 unchanged attributes hidden)

      ~ instance_refresh {
          ~ triggers = [
              + "tag",
            ]
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "14" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      + tag {
          + key                 = "ubuntu_codename"
          + propagate_at_launch = true
          + value               = "jammy"
        }

        # (8 unchanged blocks hidden)
    }

  # module.jumphost.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014"
        name             = "terraform-20240223005145929800000014"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                                   = "lt-001743d1d2257c40b"
      ~ latest_version                       = 14 -> (known after apply)
        name                                 = "jumphost-20240223005113359100000009"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKIm1vdW50cyI6Ci0gLSAiZnMtMGNiZDM3NDk1NDhkMDRkYTYuZWZzLnVzLXdlc3QtMS5hbWF6b25hd3MuY29tOi8iCiAgLSAiL2hvbWUiCiAgLSAibmZzNCIKICAtICJuZnN2ZXJzPTQuMSxyc2l6ZT0xMDQ4NTc2LHdzaXplPTEwNDg1NzYsaGFyZCx0aW1lbz02MDAscmV0cmFucz0yLG5vcmVzdnBvcnQsX25ldGRldiIKICAtICIwIgogIC0gIjAiCiJwYWNrYWdlX3VwZGF0ZSI6IHRydWUKInBhY2thZ2VzIjoKLSAibWFrZSIKLSAiZ2NjIgotICJwdXBwZXQtY29kZSIKLSAiaW5mcmFob3VzZS10b29sa2l0IgotICJpbmZyYWhvdXNlLXB1cHBldC1kYXRhIgotICJuZnMtY29tbW9uIgoicHVwcGV0IjoKICAiY29sbGVjdGlvbiI6ICJwdXBwZXQ4IgogICJpbnN0YWxsIjogdHJ1ZQogICJpbnN0YWxsX3R5cGUiOiAiYWlvIgogICJwYWNrYWdlX25hbWUiOiAicHVwcGV0LWFnZW50IgogICJzdGFydF9zZXJ2aWNlIjogZmFsc2UKInJ1bmNtZCI6Ci0gIm1vdW50IC1hIgotICIvb3B0L3B1cHBldGxhYnMvcHVwcGV0L2Jpbi9nZW0gaW5zdGFsbCBqc29uIgotICIvb3B0L3B1cHBldGxhYnMvcHVwcGV0L2Jpbi9nZW0gaW5zdGFsbCBhd3Mtc2RrLWNvcmUiCi0gIi9vcHQvcHVwcGV0bGFicy9wdXBwZXQvYmluL2dlbSBpbnN0YWxsIGF3cy1zZGstc2VjcmV0c21hbmFnZXIiCi0gImloLXB1cHBldCAgLS1lbnZpcm9ubWVudCBwcm9kdWN0aW9uIC0tZW52aXJvbm1lbnRwYXRoIHtyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzCiAgLS1yb290LWRpcmVjdG9yeSAvb3B0L3B1cHBldC1jb2RlIC0taGllcmEtY29uZmlnIC9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvcHJvZHVjdGlvbi9oaWVyYS55YW1sCiAgLS1tb2R1bGUtcGF0aCB7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXMgYXBwbHkgL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvcHJvZHVjdGlvbi9tYW5pZmVzdHMvc2l0ZS5wcCIKInNzaF9kZWxldGVrZXlzIjogdHJ1ZQoic3NoX2tleXMiOgogICJlY2RzYV9wcml2YXRlIjogIiIKICAiZWNkc2FfcHVibGljIjogIiIKICAiZWQyNTUxOV9wcml2YXRlIjogfAogICAgLS0tLS1CRUdJTiBPUEVOU1NIIFBSSVZBVEUgS0VZLS0tLS0KICAgIGIzQmxibk56YUMxclpYa3RkakVBQUFBQUJHNXZibVVBQUFBRWJtOXVaUUFBQUFBQUFBQUJBQUFBTXdBQUFBdHoKICAgIGMyZ3RaV1F5TlRVeE9RQUFBQ0RQTWdWWkdFdHF5c2gvMUJkUDVkSXVCTHEwckcxSGw3MWxBQ2ZRSHREdlJ3QUEKICAgIEFJZ1JKYk5hRVNXeldnQUFBQXR6YzJndFpXUXlOVFV4T1FBQUFDRFBNZ1ZaR0V0cXlzaC8xQmRQNWRJdUJMcTAKICAgIHJHMUhsNzFsQUNmUUh0RHZSd0FBQUVBaFhNQjRJTXc5NTF0QUE2UnVIVkExd2s1T3VRY3BNRDhnUzMydUs3ZmcKICAgIGFjOHlCVmtZUzJyS3lIL1VGMC9sMGk0RXVyU3NiVWVYdldVQUo5QWUwTzlIQUFBQUFBRUNBd1FGCiAgICAtLS0tLUVORCBPUEVOU1NIIFBSSVZBVEUgS0VZLS0tLS0KICAiZWQyNTUxOV9wdWJsaWMiOiB8CiAgICBzc2gtZWQyNTUxOSBBQUFBQzNOemFDMWxaREkxTlRFNUFBQUFJTTh5QlZrWVMyckt5SC9VRjAvbDBpNEV1clNzYlVlWHZXVUFKOUFlME85SAogICJyc2FfcHJpdmF0ZSI6IHwKICAgIC0tLS0tQkVHSU4gT1BFTlNTSCBQUklWQVRFIEtFWS0tLS0tCiAgICBiM0JsYm5OemFDMXJaWGt0ZGpFQUFBQUFCRzV2Ym1VQUFBQUVibTl1WlFBQUFBQUFBQUFCQUFBQ0Z3QUFBQWR6CiAgICBjMmd0Y25OaEFBQUFBd0VBQVFBQUFnRUF0VXNCYmdZcXJLSmtBWXNGYVlMeGVTWDhoeUw4S202MkUzb1lLZzNhCiAgICBsdkU0SEl0TmdvWlZPMDBTK0dlOFFJMC9VVFF1V2xNUXJ6U01SOEI3ZnNNdXFqRmgremxOU09uZUhVRlBXMVNYCiAgICBTbXpMdFp5NFI1YnNBQnRmdGxXN0wvOC90UXY0RjRhNE04VWtHVU5veXRLQnlNYzRINCtldkkyeFNUVXhIanZzCiAgICBZbGFleUxCNDI3UVRiSmw2cW5MV3hPZGRUWWRaRUNxclJXQXJrVkZLbWMwVVJjTTV6T1d6UkhOeWlqK1B4VUgzCiAgICBGVkw5cUtaTGZ5OG8vM0w5YzlrZllLNlNmYWhpRmtLMW91NWgzRzF3RytSTEgreHU4NDliT0lkWE9zV2NLUGlYCiAgICBLTCtOdmdEaU8vMW9lbERON1JzVk9jY1hjUjZLemsva2szVS82c0lNVUZqM1p0VWhoeXgybXBIWVF0RlRUZXJKCiAgICBXWHV3YnBSUjBEdmdBd3c3V3BDaGVPWEZIK3hTRVBGV2hHRTA2dUV4Q0k4bVZmcFAwRjJiM2FkUHhCa01qVHJ0CiAgICBuZFhjRDJ5MEIvWisweG40U3htRnFBciszdXErdWp1bG9zVzBkUE9mWlhPTGZ0WThIZTJKK0QrQlhITTFuSVVhCiAgICBEd0Y1WnUzelhzcWM0ZHpXNUJLTnF2MTFoS3hqNXFnMHJjN0x4cVpXVW80aStNSGNuUC90WlZzejhxNkVqVE55CiAgICBhaFQvdkZtY2NmRXFwTFFYNzA0WHNwekp3a05WSm9UUkJqMnlRWnlLQk1ONzIyeXlOOXpZZjc4SFlXZm5yUDZkCiAgICBzMlphUlczV001c0c0YzVPK1g0alhxN2NwOEwzenJ4VUNuMFpHZkZjam9weTNNbnM3eUFiKzk4VG96eVNqL05NCiAgICBDaE1BQUFjNEI1QXJJQWVRS3lBQUFBQUhjM05vTFhKellRQUFBZ0VBdFVzQmJnWXFyS0prQVlzRmFZTHhlU1g4CiAgICBoeUw4S202MkUzb1lLZzNhbHZFNEhJdE5nb1pWTzAwUytHZThRSTAvVVRRdVdsTVFyelNNUjhCN2ZzTXVxakZoCiAgICAremxOU09uZUhVRlBXMVNYU216THRaeTRSNWJzQUJ0ZnRsVzdMLzgvdFF2NEY0YTRNOFVrR1VOb3l0S0J5TWM0CiAgICBINCtldkkyeFNUVXhIanZzWWxhZXlMQjQyN1FUYkpsNnFuTFd4T2RkVFlkWkVDcXJSV0Fya1ZGS21jMFVSY001CiAgICB6T1d6UkhOeWlqK1B4VUgzRlZMOXFLWkxmeThvLzNMOWM5a2ZZSzZTZmFoaUZrSzFvdTVoM0cxd0crUkxIK3h1CiAgICA4NDliT0lkWE9zV2NLUGlYS0wrTnZnRGlPLzFvZWxETjdSc1ZPY2NYY1I2S3prL2trM1UvNnNJTVVGajNadFVoCiAgICBoeXgybXBIWVF0RlRUZXJKV1h1d2JwUlIwRHZnQXd3N1dwQ2hlT1hGSCt4U0VQRldoR0UwNnVFeENJOG1WZnBQCiAgICAwRjJiM2FkUHhCa01qVHJ0bmRYY0QyeTBCL1orMHhuNFN4bUZxQXIrM3VxK3VqdWxvc1cwZFBPZlpYT0xmdFk4CiAgICBIZTJKK0QrQlhITTFuSVVhRHdGNVp1M3pYc3FjNGR6VzVCS05xdjExaEt4ajVxZzByYzdMeHFaV1VvNGkrTUhjCiAgICBuUC90WlZzejhxNkVqVE55YWhUL3ZGbWNjZkVxcExRWDcwNFhzcHpKd2tOVkpvVFJCajJ5UVp5S0JNTjcyMnl5CiAgICBOOXpZZjc4SFlXZm5yUDZkczJaYVJXM1dNNXNHNGM1TytYNGpYcTdjcDhMM3pyeFVDbjBaR2ZGY2pvcHkzTW5zCiAgICA3eUFiKzk4VG96eVNqL05NQ2hNQUFBQURBUUFCQUFBQ0FBTzVNS1JUMkJpSGxVbzYwcmVpQ3RlVUlpV2NZRlYyCiAgICB4S0tOeFdWSHQ0K1dFTEwxWVhnbXppVlRwZW9ZSjFPa0V3TFY4WVhGWXZoV09mTlhUcklCekRtT25oYU16THVNCiAgICBvaFV6dkMrQ0EwRnlEcFVDVFA2YmFPbHZwbjJXTVN3Qk1BdkYzU2lPaWNYMmJKRmdRd3kzV2hjSGtHMkZnNXNYCiAgICB4ZVpkQTA4OXA5TTFPRG1pOWpoODhGRXdyY1pHYVliTndhclA5dEpRTGdoVXUxQld2Uk4vbE1VQ0IzUGYyOWl5CiAgICBEazRzbEFWWEgzMytvRnNRWDBpVGJXSWh1SGJpcExSVm9ZaVhKcnlTVGl5MGZLb01UVnNsU3kyeXEyeXhLd3gwCiAgICBLeVIzM29jdzQ5bmdaVWJidWNuRm9KbXlneWcxZ0RBWm1LK29FdTI5MGxIOC9IMFQwekRyUXRsKytKSkFIY2JECiAgICBFdStQZU5HbHZIMkh1czlFTzJuR1dZb1N0M2kwZWNEVWF2TjFhZys1TENyc0JWbDBjRVFZTHNlSDJUSXhOTm1lCiAgICB2QzdkRWU3TXVtOFpyNHpnYzM1L0lUYzlGQkhFc0loVU9NdGVWWnF5bkpPNHFHMERwZjNZUEcyTUVlekRyektZCiAgICBrNWUzMEsyS0grTFJady9jT2kwM2pzVkNiV2hGejJ3bExCb2NzOW5pN0VPRnVkN3NFbXZENlBBNVFkdy9seGFFCiAgICAxL0d1aWQ2cG1uTUsxdHVxTUpqSmlrRkhlZW9QNGtSTzRkcXRSYytMcnFKc29lR3YvREFjbmJEK2ZxRC8ycUE5CiAgICBUU1E3Zy9BRHRjcTJHRzlpaWx6NXlIbnQ4K3hydVcrZ0ZtcW50Q3FqYUZLelV4N1Z5RUtjVk5wNjdnbGF5T2U0CiAgICBLbUNiUkxpdGtaZkJBQUFCQUI1NllnR2lsTXVtR3E4M0ZaSWNXaVZtZ1hTZTN5eUlMZm11MUZqblRQeWVlV21ECiAgICBPYUFtWXpObVJkZmlPdkZycURxeW81M1VmY2dEanpYaFQ4S0piaGpWbUFTdjlybzhTL1BTdUROZ250Y3k1dTkrCiAgICB6enhIWXg1NVhxMnUrTkhoRitDN1dUNzZJQlN5Mll3Mm9kWmNScHhic2FvemJ5cDBrNUh5VlBxTjBnaWpyOXZrCiAgICA5Mk1odXl3Q0ZCdzlOaU55cVFYdUJsMFdMMnl5eG1vckV5VFh1SmtmVEo5YXNwL3NXdzVZMnlLMTJ0TUxNUE9FCiAgICBBNHFFM3pzU0U0K1o0Qldya1d5cVN0V1BQeG94OHpWN3VHZnVzcTRCRFd4Rks4aFhjbER2VSs1blpJckZRTGlGCiAgICA2amh6WVUzc0xhN2wwcEtIQjJWV1dmbTZOTm10cTFyK05IWHVRTThBQUFFQkFONVp2NzQ1OE1OeW1kTHZZUkdvCiAgICB4U3BtaHNhVzNSZW5IdHRGTFpWNEJRRWdNOFpnU3FQb1J4dXg2Z2JWbDI4NDJZV0lWTExXR2UvZ1c1ZVl6V0dDCiAgICBXL01VbmJSVGdFUjVNa1dRQmFzMVplUytIcFcwQUcyNWdiQ003cjRiUHNpYXF3c3RrUUhOL1d5Mkh1WE1QZDFaCiAgICArRmNRREd5UlExbUEzbFdWdHZWbzFQKzVmLzVtZFBES1FlMDJzRWx4YXRDSEhkdkZuU2YydloyVXBXcFM2TE5KCiAgICBhTnBtYy9wNTR3WTFPRWEzZXlnRnRqY2JSOE94L2kwVmdHTFlOVW9rMHhoY1RzQlovbTg1dlp4cUdxSUVURGRoCiAgICBwd2ExdjBPWkJ1bFVQT2Zra1JWRVJVTFlKWmpZc1dWbEZ5TDAxek9VYmdPa0I5R0dnbGhGc3VUUWpaTmd3eThOCiAgICBHRU1BQUFFQkFOQzZuUk96TFVJWGoyNG0yYmttQzFZclNQd0NGS2tiaFcwbU51R1d3WFdjOVRWQVRGZ2FKKzhjCiAgICB4M1IzZlRZMFN1THord1ViTWJvaXBZSnhISW11LzYwRlZ4ZklrMTVrUmozbjY0UHdOUktqdXNyRzBodW92TTVmCiAgICA0aitZYUc1b1QxTDBob2RSekhXUU9Yc1Q1OUoyZnFWOVJobUgzd0xNdk8zVkEydVB1NkdpU2NIRzc5dUdHdHhmCiAgICBWR0J4VEhyb1NZM1RBUmJhZkdQRFZxOHE4cFI5VStoMFNoTUNDaU1Pd095VVJpa05BUitvMjBoamVqampFQk1YCiAgICBPc0VjaFpTM3h6ZWpRYlJ4ZVg3SkhBdDNjQStMZUF0YitCaG9vWEhscTZwWHNxYm0xS21oMk42bUZqRjVBcUp5CiAgICArR1R4ZzdIa3ZXMTE5M2NsVHoyU2NFS2VPRnhaVWZFQUFBQUFBUUlECiAgICAtLS0tLUVORCBPUEVOU1NIIFBSSVZBVEUgS0VZLS0tLS0KICAicnNhX3B1YmxpYyI6IHwKICAgIHNzaC1yc2EgQUFBQUIzTnphQzF5YzJFQUFBQURBUUFCQUFBQ0FRQzFTd0Z1Qmlxc29tUUJpd1ZwZ3ZGNUpmeUhJdndxYnJZVGVoZ3FEZHFXOFRnY2kwMkNobFU3VFJMNFo3eEFqVDlSTkM1YVV4Q3ZOSXhId0h0K3d5NnFNV0g3T1UxSTZkNGRRVTliVkpkS2JNdTFuTGhIbHV3QUcxKzJWYnN2L3orMUMvZ1hocmd6eFNRWlEyakswb0hJeHpnZmo1NjhqYkZKTlRFZU8reGlWcDdJc0hqYnRCTnNtWHFxY3RiRTUxMU5oMWtRS3F0RllDdVJVVXFaelJSRnd6bk01Yk5FYzNLS1A0L0ZRZmNWVXYyb3BrdC9MeWovY3YxejJSOWdycEo5cUdJV1FyV2k3bUhjYlhBYjVFc2Y3Rzd6ajFzNGgxYzZ4WndvK0pjb3Y0MitBT0k3L1doNlVNM3RHeFU1eHhkeEhvck9UK1NUZFQvcXdneFFXUGRtMVNHSExIYWFrZGhDMFZOTjZzbFplN0J1bEZIUU8rQURERHRha0tGNDVjVWY3RklROFZhRVlUVHE0VEVJanlaVitrL1FYWnZkcDAvRUdReU5PdTJkMWR3UGJMUUg5bjdUR2ZoTEdZV29DdjdlNnI2Nk82V2l4YlIwODU5bGM0dCsxandkN1luNFA0RmNjeldjaFJvUEFYbG03Zk5leXB6aDNOYmtFbzJxL1hXRXJHUG1xRFN0enN2R3BsWlNqaUw0d2R5Yy8rMWxXelB5cm9TTk0zSnFGUCs4V1p4eDhTcWt0QmZ2VGhleW5NbkNRMVVtaE5FR1BiSkJuSW9FdzN2YmJMSTMzTmgvdndkaForZXMvcDJ6WmxwRmJkWXptd2Joems3NWZpTmVydHlud3ZmT3ZGUUtmUmtaOFZ5T2luTGN5ZXp2SUJ2NzN4T2pQSktQODB3S0V3PT0KIndyaXRlX2ZpbGVzIjoKLSAiY29udGVudCI6ICJleHBvcnQgQVdTX0RFRkFVTFRfUkVHSU9OPXVzLXdlc3QtMSIKICAicGF0aCI6ICIvZXRjL3Byb2ZpbGUuZC9hd3Muc2giCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCi0gImNvbnRlbnQiOiB8LQogICAgW2RlZmF1bHRdCiAgICByZWdpb249dXMtd2VzdC0xCiAgInBhdGgiOiAiL3Jvb3QvLmF3cy9jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2MDAiCi0gImNvbnRlbnQiOiB8CiAgICAicHVwcGV0X2Vudmlyb25tZW50IjogInByb2R1Y3Rpb24iCiAgICAicHVwcGV0X3JvbGUiOiAianVtcGhvc3QiCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL3B1cHBldC55YW1sIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogIntcImloLXB1cHBldFwiOntcImRlYnVnXCI6ZmFsc2UsXCJlbnZpcm9ubWVudHBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vZW52aXJvbm1lbnRzXCIsXCJoaWVyYS1jb25maWdcIjpcIi9vcHQvaW5mcmFob3VzZS1wdXBwZXQtZGF0YS9lbnZpcm9ubWVudHMvcHJvZHVjdGlvbi9oaWVyYS55YW1sXCIsXCJtYW5pZmVzdFwiOlwiL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvcHJvZHVjdGlvbi9tYW5pZmVzdHMvc2l0ZS5wcFwiLFwibW9kdWxlLXBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vbW9kdWxlc1wiLFwicm9vdC1kaXJlY3RvcnlcIjpcIi9vcHQvcHVwcGV0LWNvZGVcIn19IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9paC1wdXBwZXQuanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7fSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvY3VzdG9tLmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K" -> (known after apply)
userdata changes:
--- before
+++ after
@@ -1,188 +1 @@
-Content-Type: multipart/mixed; boundary="MIMEBOUNDARY"
-MIME-Version: 1.0
-
---MIMEBOUNDARY
-Content-Transfer-Encoding: 7bit
-Content-Type: text/cloud-config
-Mime-Version: 1.0
-
-#cloud-config
-"apt":
-  "sources":
-    "infrahouse":
-      "key": |
-        -----BEGIN PGP PUBLIC KEY BLOCK-----
-
-        mQINBGS7FtkBEADF+YmDg6Qvsv5V6ZQw+QhxdTvjMXeLC9T6RFRVD947qKztNNQn
-        +A/yxprLAmW25Uu/11oCszNVIIaR3OY8MtyilbCtzUkBzvWdlX3HvTw91Lp8bxUL
-        EXOM9nscqOrOvfBjanplKDEKPMY6vIZ3kp1rUsCNGLBL0x2KZgU80ulRsMM8qnBN
-        kpTiAeXKOEVtRzlWlvOFLJ7pYDvaZ0UgHSVuE+ZkldqOdLLRpKkdIvJPckXqL5xT
-        UvWTW1enFAHd5+NQxMnCa3ikjQV3DTlEjsgLLQbbysXjXPr6PIPs29cTcfoq431O
-        tR4DrZB4vMEOA88TmKBkEiMG+iB9cjz5wBIuMu95ZmoJxdvjPR72FYKgrCXNtNhd
-        VerERvpLThdaRmZgi7ly+DvkY7LqyJPvdHcqxedgFnPKR4T+gSQmbUPd9qqdJR0Q
-        Kl/PmtuS/w9gy2Z4ay0QIKrNBzQxhA8LDZpp1rufCJ5+ZMef90vHpwxM+OaPryNl
-        EdDW7YQ8fuB5nPqjwUApmlYYLJYld7vJ79EIx/sjgh6G+IFim7xR7WiQF/nJevfq
-        vzYO7or/GICb6eZwvPdty79HmVePqETlDU00oyopWyTsYySYDSHn/4doTux8v+F/
-        YeybvgqbriH7iSF8HxwEFeDjrMtUTHsXC35DHFeMChJoxsyKv48J+bIGFwARAQAB
-        tC1JbmZyYUhvdXNlIFBhY2thZ2VyIDxwYWNrYWdlckBpbmZyYWhvdXNlLmNvbT6J
-        AlQEEwEKAD4WIQSiNh5kY3w8W0gAF8XguJaoxfcD7wUCZLsW2QIbAwUJA8JnAAUL
-        CQgHAgYVCgkICwIEFgIDAQIeAQIXgAAKCRDguJaoxfcD7wb7D/9enbtO1DEQn1Pt
-        hgktH+IrbBdYRHk71il2hbnmAboLkk1ak/aaQY/XQDJFhrA7jMkPLOCReotHiQmv
-        1UfqDcM2eQ4/x0N9F2DLUSkuww117vttUoBxirB72pO0T/ld9o39SHMC/Dfk6y6h
-        tTGqxLgh8j3DSyO5EErJLa/3BvMqr4iqb3PTwNeDREjavQJhXSvEFjyACoo9d7rs
-        7lhCbbSPjgTcG/PCfzLr37QyzXiTR/TwjiwVdThdCS/CKnsoM8ngHxjXYpK7M6wg
-        tzA8JkHZr5MpkrPGrgQevhJBLkHR/jcsaaBZN7nw8aeHcwwM4/ChHIyZdQ91059p
-        OMaYmWmjPQfq1rOnAAvA1xWw+TZNzHgWIq4vusx7OBvrFsVeZNsqd7Oa4prtVWg0
-        91cKZJo/Ov6opM/wDWN2yBnkmBCwaXpoH5NDQ22bhnGTJeIWdei8USGpvBkTxBI2
-        X32pyOmZDn81L2zM2ioNvgXIb5u5tjb9NOiAt6oW0G0x00dgr3r6pu8qmMwkBVBC
-        vWwEmaxQnkThnbAd57Vbat4//uDcHFpDaBPpFWeCL2dfDSrS9iiK6K1VkvGLoXh8
-        MpJqjoddpfNh4uyfzKyNE1drQ29mcwfIlzXoPrb09W6ZHpm+tqd8Mk707zwsdFGR
-        qRsxmtPn9J1reYZiVuE5G26f1aKTR7kCDQRkuxbZARAA4+9kn4smBXZcM0vFq9R8
-        24XKZtTaVmVoVJMRQM44qWR+s/S0MzvbO5u0cSVThY65YzMLs920UY6uGpoS2ZYw
-        IMipkaB+2F6B8R7V7nl/SgaXGa2MexkC7wt6blFbaw7pbvI+iI9wS8BKHgMDzd0F
-        TjSq9vdkVkf7yI3hEwllX7zT6ILOvknNGbos0dFI92cBWQs+iXP50xDVit3+9mCD
-        ruWVYk73mvSEzFcuXCybKJ5U/nzSQ70JoQmSPc50RQjuHGdzl/YzGFaFn5zIZ5pP
-        k5S+KTYekzciRkHzbea5Pj+A6KZilKj5ykARFzw+CPxqsuejDki7A+a3m3WGq+mm
-        AklQ4YBcolzNOpgWclISuE3d5kgtaJACIgte87F6QBBsk8oDBFQCnZmoOirlSlbf
-        JuD6fVCJu2zY7ThN1O0oWTwAaNAvM55CLTv6s3FmtR92lnlQDFuJ+fj863c6qx14
-        FuO4mM7euS08wGgVGm91wA7bYl4ahxC6S2BGB5FvkZfzBBwjsfmUWHAu7VRZJxkX
-        Jp696OTdR3RfI7IZ6OW6tGELijswWbbZXb5XRWEW99vWO7NIK6sOvhMDNp9bSMub
-        XP3PbPxgyT0bmss0ywNYwucnfcmDXqPVu3Gdt53at1+hK7mlnQ3uUs5eVEOIHnJm
-        f1trDggSTE7fnkx6Czl+iMkAEQEAAYkCPAQYAQoAJhYhBKI2HmRjfDxbSAAXxeC4
-        lqjF9wPvBQJkuxbZAhsMBQkDwmcAAAoJEOC4lqjF9wPv8SQP/jsQfJCUHrjpX4fP
-        0NtVyqlCrq1OmLP7BLrXrCxoAFRb64YJUdWk5P35k9wj2BQjpjcNj2ik80Foo02E
-        yc+PzW/4tzVvdxRrEzsOFm+mMR+llUHAKzBa6QBxHT0ofL7p5XYTuMNnYo+PjVMm
-        jP3TEJGYXYmuhGfaaJZpjLmJFqp59x//dsMHeLqUChwb6Cg6DukAiheAs3P+rXo3
-        tBnA4JCCiXR7//0WezRoSPdalNem4vs8PT87snHbDliFMVf8w+fksInqvotiRDI4
-        QBrBfs3NdeZW/tmupOaZJRzHDvvKbg//O6ip1aPvILWvTDM8KcQCQESaWkCbI1uc
-        rizAMblTB2gyw9yojCpVCMBXdizAqqyl5ZVrw4+X/i09IsNt8hA9/5RY7v3c7Z2C
-        Xy2xKWmtLI9nlOSSwUxB566I29lVKBLUmXmQfnRIIHCiJDXYFDP/6Lfv9+mhEWU8
-        qed3xhpeNSAIzA+MTljtiRmorxpddiXbtCafcPl/J3X0B07fccJZwZsCYCptLy1c
-        yvVaN+EBmjoCp3jt6wLe4xclqU3ACwz/8TDDmtJ7UUdl7MdkipQZ278L2kpl6o61
-        MF2fXD7fZMeZfEw6lu0BF5mZ0/ch3HxXeZoXif79g25vZmSdW97pceewPlvlETFQ
-        55pMorQyUTEQCQ3ECzHYSnL/TmW7
-        =+0Rc
-        -----END PGP PUBLIC KEY BLOCK-----
-      "source": "deb [signed-by=$KEY_FILE] https://release-jammy.infrahouse.com/ $RELEASE
-        main"
-"mounts":
-- - "fs-0cbd3749548d04da6.efs.us-west-1.amazonaws.com:/"
-  - "/home"
-  - "nfs4"
-  - "nfsvers=4.1,rsize=1048576,wsize=1048576,hard,timeo=600,retrans=2,noresvport,_netdev"
-  - "0"
-  - "0"
-"package_update": true
-"packages":
-- "make"
-- "gcc"
-- "puppet-code"
-- "infrahouse-toolkit"
-- "infrahouse-puppet-data"
-- "nfs-common"
-"puppet":
-  "collection": "puppet8"
-  "install": true
-  "install_type": "aio"
-  "package_name": "puppet-agent"
-  "start_service": false
-"runcmd":
-- "mount -a"
-- "/opt/puppetlabs/puppet/bin/gem install json"
-- "/opt/puppetlabs/puppet/bin/gem install aws-sdk-core"
-- "/opt/puppetlabs/puppet/bin/gem install aws-sdk-secretsmanager"
-- "ih-puppet  --environment production --environmentpath {root_directory}/environments
-  --root-directory /opt/puppet-code --hiera-config /opt/infrahouse-puppet-data/environments/production/hiera.yaml
-  --module-path {root_directory}/modules apply /opt/puppet-code/environments/production/manifests/site.pp"
-"ssh_deletekeys": true
-"ssh_keys":
-  "ecdsa_private": ""
-  "ecdsa_public": ""
-  "ed25519_private": |
-    -----BEGIN OPENSSH PRIVATE KEY-----
-    b3BlbnNzaC1rZXktdjEAAAAABG5vbmUAAAAEbm9uZQAAAAAAAAABAAAAMwAAAAtz
-    c2gtZWQyNTUxOQAAACDPMgVZGEtqysh/1BdP5dIuBLq0rG1Hl71lACfQHtDvRwAA
-    AIgRJbNaESWzWgAAAAtzc2gtZWQyNTUxOQAAACDPMgVZGEtqysh/1BdP5dIuBLq0
-    rG1Hl71lACfQHtDvRwAAAEAhXMB4IMw951tAA6RuHVA1wk5OuQcpMD8gS32uK7fg
-    ac8yBVkYS2rKyH/UF0/l0i4EurSsbUeXvWUAJ9Ae0O9HAAAAAAECAwQF
-    -----END OPENSSH PRIVATE KEY-----
-  "ed25519_public": |
-    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIM8yBVkYS2rKyH/UF0/l0i4EurSsbUeXvWUAJ9Ae0O9H
-  "rsa_private": |
-    -----BEGIN OPENSSH PRIVATE KEY-----
-    b3BlbnNzaC1rZXktdjEAAAAABG5vbmUAAAAEbm9uZQAAAAAAAAABAAACFwAAAAdz
-    c2gtcnNhAAAAAwEAAQAAAgEAtUsBbgYqrKJkAYsFaYLxeSX8hyL8Km62E3oYKg3a
-    lvE4HItNgoZVO00S+Ge8QI0/UTQuWlMQrzSMR8B7fsMuqjFh+zlNSOneHUFPW1SX
-    SmzLtZy4R5bsABtftlW7L/8/tQv4F4a4M8UkGUNoytKByMc4H4+evI2xSTUxHjvs
-    YlaeyLB427QTbJl6qnLWxOddTYdZECqrRWArkVFKmc0URcM5zOWzRHNyij+PxUH3
-    FVL9qKZLfy8o/3L9c9kfYK6SfahiFkK1ou5h3G1wG+RLH+xu849bOIdXOsWcKPiX
-    KL+NvgDiO/1oelDN7RsVOccXcR6Kzk/kk3U/6sIMUFj3ZtUhhyx2mpHYQtFTTerJ
-    WXuwbpRR0DvgAww7WpCheOXFH+xSEPFWhGE06uExCI8mVfpP0F2b3adPxBkMjTrt
-    ndXcD2y0B/Z+0xn4SxmFqAr+3uq+ujulosW0dPOfZXOLftY8He2J+D+BXHM1nIUa
-    DwF5Zu3zXsqc4dzW5BKNqv11hKxj5qg0rc7LxqZWUo4i+MHcnP/tZVsz8q6EjTNy
-    ahT/vFmccfEqpLQX704XspzJwkNVJoTRBj2yQZyKBMN722yyN9zYf78HYWfnrP6d
-    s2ZaRW3WM5sG4c5O+X4jXq7cp8L3zrxUCn0ZGfFcjopy3Mns7yAb+98TozySj/NM
-    ChMAAAc4B5ArIAeQKyAAAAAHc3NoLXJzYQAAAgEAtUsBbgYqrKJkAYsFaYLxeSX8
-    hyL8Km62E3oYKg3alvE4HItNgoZVO00S+Ge8QI0/UTQuWlMQrzSMR8B7fsMuqjFh
-    +zlNSOneHUFPW1SXSmzLtZy4R5bsABtftlW7L/8/tQv4F4a4M8UkGUNoytKByMc4
-    H4+evI2xSTUxHjvsYlaeyLB427QTbJl6qnLWxOddTYdZECqrRWArkVFKmc0URcM5
-    zOWzRHNyij+PxUH3FVL9qKZLfy8o/3L9c9kfYK6SfahiFkK1ou5h3G1wG+RLH+xu
-    849bOIdXOsWcKPiXKL+NvgDiO/1oelDN7RsVOccXcR6Kzk/kk3U/6sIMUFj3ZtUh
-    hyx2mpHYQtFTTerJWXuwbpRR0DvgAww7WpCheOXFH+xSEPFWhGE06uExCI8mVfpP
-    0F2b3adPxBkMjTrtndXcD2y0B/Z+0xn4SxmFqAr+3uq+ujulosW0dPOfZXOLftY8
-    He2J+D+BXHM1nIUaDwF5Zu3zXsqc4dzW5BKNqv11hKxj5qg0rc7LxqZWUo4i+MHc
-    nP/tZVsz8q6EjTNyahT/vFmccfEqpLQX704XspzJwkNVJoTRBj2yQZyKBMN722yy
-    N9zYf78HYWfnrP6ds2ZaRW3WM5sG4c5O+X4jXq7cp8L3zrxUCn0ZGfFcjopy3Mns
-    7yAb+98TozySj/NMChMAAAADAQABAAACAAO5MKRT2BiHlUo60reiCteUIiWcYFV2
-    xKKNxWVHt4+WELL1YXgmziVTpeoYJ1OkEwLV8YXFYvhWOfNXTrIBzDmOnhaMzLuM
-    ohUzvC+CA0FyDpUCTP6baOlvpn2WMSwBMAvF3SiOicX2bJFgQwy3WhcHkG2Fg5sX
-    xeZdA089p9M1ODmi9jh88FEwrcZGaYbNwarP9tJQLghUu1BWvRN/lMUCB3Pf29iy
-    Dk4slAVXH33+oFsQX0iTbWIhuHbipLRVoYiXJrySTiy0fKoMTVslSy2yq2yxKwx0
-    KyR33ocw49ngZUbbucnFoJmygyg1gDAZmK+oEu290lH8/H0T0zDrQtl++JJAHcbD
-    Eu+PeNGlvH2Hus9EO2nGWYoSt3i0ecDUavN1ag+5LCrsBVl0cEQYLseH2TIxNNme
-    vC7dEe7Mum8Zr4zgc35/ITc9FBHEsIhUOMteVZqynJO4qG0Dpf3YPG2MEezDrzKY
-    k5e30K2KH+LRZw/cOi03jsVCbWhFz2wlLBocs9ni7EOFud7sEmvD6PA5Qdw/lxaE
-    1/Guid6pmnMK1tuqMJjJikFHeeoP4kRO4dqtRc+LrqJsoeGv/DAcnbD+fqD/2qA9
-    TSQ7g/ADtcq2GG9iilz5yHnt8+xruW+gFmqntCqjaFKzUx7VyEKcVNp67glayOe4
-    KmCbRLitkZfBAAABAB56YgGilMumGq83FZIcWiVmgXSe3yyILfmu1FjnTPyeeWmD
-    OaAmYzNmRdfiOvFrqDqyo53UfcgDjzXhT8KJbhjVmASv9ro8S/PSuDNgntcy5u9+
-    zzxHYx55Xq2u+NHhF+C7WT76IBSy2Yw2odZcRpxbsaozbyp0k5HyVPqN0gijr9vk
-    92MhuywCFBw9NiNyqQXuBl0WL2yyxmorEyTXuJkfTJ9asp/sWw5Y2yK12tMLMPOE
-    A4qE3zsSE4+Z4BWrkWyqStWPPxox8zV7uGfusq4BDWxFK8hXclDvU+5nZIrFQLiF
-    6jhzYU3sLa7l0pKHB2VWWfm6NNmtq1r+NHXuQM8AAAEBAN5Zv7458MNymdLvYRGo
-    xSpmhsaW3RenHttFLZV4BQEgM8ZgSqPoRxux6gbVl2842YWIVLLWGe/gW5eYzWGC
-    W/MUnbRTgER5MkWQBas1ZeS+HpW0AG25gbCM7r4bPsiaqwstkQHN/Wy2HuXMPd1Z
-    +FcQDGyRQ1mA3lWVtvVo1P+5f/5mdPDKQe02sElxatCHHdvFnSf2vZ2UpWpS6LNJ
-    aNpmc/p54wY1OEa3eygFtjcbR8Ox/i0VgGLYNUok0xhcTsBZ/m85vZxqGqIETDdh
-    pwa1v0OZBulUPOfkkRVERULYJZjYsWVlFyL01zOUbgOkB9GGglhFsuTQjZNgwy8N
-    GEMAAAEBANC6nROzLUIXj24m2bkmC1YrSPwCFKkbhW0mNuGWwXWc9TVATFgaJ+8c
-    x3R3fTY0SuLz+wUbMboipYJxHImu/60FVxfIk15kRj3n64PwNRKjusrG0huovM5f
-    4j+YaG5oT1L0hodRzHWQOXsT59J2fqV9RhmH3wLMvO3VA2uPu6GiScHG79uGGtxf
-    VGBxTHroSY3TARbafGPDVq8q8pR9U+h0ShMCCiMOwOyURikNAR+o20hjejjjEBMX
-    OsEchZS3xzejQbRxeX7JHAt3cA+LeAtb+BhooXHlq6pXsqbm1Kmh2N6mFjF5AqJy
-    +GTxg7HkvW1193clTz2ScEKeOFxZUfEAAAAAAQID
-    -----END OPENSSH PRIVATE KEY-----
-  "rsa_public": |
-    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC1SwFuBiqsomQBiwVpgvF5JfyHIvwqbrYTehgqDdqW8Tgci02ChlU7TRL4Z7xAjT9RNC5aUxCvNIxHwHt+wy6qMWH7OU1I6d4dQU9bVJdKbMu1nLhHluwAG1+2Vbsv/z+1C/gXhrgzxSQZQ2jK0oHIxzgfj568jbFJNTEeO+xiVp7IsHjbtBNsmXqqctbE511Nh1kQKqtFYCuRUUqZzRRFwznM5bNEc3KKP4/FQfcVUv2opkt/Lyj/cv1z2R9grpJ9qGIWQrWi7mHcbXAb5Esf7G7zj1s4h1c6xZwo+Jcov42+AOI7/Wh6UM3tGxU5xxdxHorOT+STdT/qwgxQWPdm1SGHLHaakdhC0VNN6slZe7BulFHQO+ADDDtakKF45cUf7FIQ8VaEYTTq4TEIjyZV+k/QXZvdp0/EGQyNOu2d1dwPbLQH9n7TGfhLGYWoCv7e6r66O6WixbR0859lc4t+1jwd7Yn4P4FcczWchRoPAXlm7fNeypzh3NbkEo2q/XWErGPmqDStzsvGplZSjiL4wdyc/+1lWzPyroSNM3JqFP+8WZxx8SqktBfvTheynMnCQ1UmhNEGPbJBnIoEw3vbbLI33Nh/vwdhZ+es/p2zZlpFbdYzmwbhzk75fiNertynwvfOvFQKfRkZ8VyOinLcyezvIBv73xOjPJKP80wKEw==
-"write_files":
-- "content": "export AWS_DEFAULT_REGION=us-west-1"
-  "path": "/etc/profile.d/aws.sh"
-  "permissions": "0644"
-- "content": |-
-    [default]
-    region=us-west-1
-  "path": "/root/.aws/config"
-  "permissions": "0600"
-- "content": |
-    "puppet_environment": "production"
-    "puppet_role": "jumphost"
-  "path": "/etc/puppetlabs/facter/facts.d/puppet.yaml"
-  "permissions": "0644"
-- "content": "{\"ih-puppet\":{\"debug\":false,\"environmentpath\":\"{root_directory}/environments\",\"hiera-config\":\"/opt/infrahouse-puppet-data/environments/production/hiera.yaml\",\"manifest\":\"/opt/puppet-code/environments/production/manifests/site.pp\",\"module-path\":\"{root_directory}/modules\",\"root-directory\":\"/opt/puppet-code\"}}"
-  "path": "/etc/puppetlabs/facter/facts.d/ih-puppet.json"
-  "permissions": "0644"
-- "content": "{}"
-  "path": "/etc/puppetlabs/facter/facts.d/custom.json"
-  "permissions": "0644"
-
---MIMEBOUNDARY--
+(known after apply)
EOF userdata changes.
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.jumphost.tls_private_key.ecdsa must be replaced
+/- resource "tls_private_key" "ecdsa" {
      ~ ecdsa_curve                   = "P224" -> "P256" # forces replacement
      ~ id                            = "f4e8b178c22d449e1c6962ff444a8d1663fe5f4a" -> (known after apply)
      + private_key_openssh           = (sensitive value)
      ~ private_key_pem               = (sensitive value)
      ~ private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      ~ public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            ME4wEAYHKoZIzj0CAQYFK4EEACEDOgAE838vl1mCYIQU0Dwf9fOGlsjsQOFM3JYk
            S+E8n0abh7CjSqUv4+4v5sUnV9ZGHqPwjL9kI0uUlvw=
            -----END PUBLIC KEY-----
        EOT -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881",
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be updated in-place
  ~ resource "aws_autoscaling_group" "postfix" {
        id                               = "postfix-20240326221552532900000008-5Qy881"
        name                             = "postfix-20240326221552532900000008-5Qy881"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "20" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-2024032622160941250000000a"
        name             = "terraform-2024032622160941250000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_launch_template.postfix will be updated in-place
  ~ resource "aws_launch_template" "postfix" {
        id                                   = "lt-0e5d85805b1236e19"
      ~ image_id                             = "ami-0c64a34bf821b0cd1" -> "ami-05e1c8b4e753b29d3"
      ~ latest_version                       = 20 -> (known after apply)
        name                                 = "postfix-20240326221552532900000008"
        tags                                 = {
            "created_by_module" = "infrahouse/postfix/aws"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.osv-scanner-github.aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/osv-scanner:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for a GitHub Actions runner in repo osv-scanner"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-osv-scanner-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/github-role/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/github-role/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.terraform-aws-github-backup.aws_autoscaling_group.main will be updated in-place
  ~ resource "aws_autoscaling_group" "main" {
        id                               = "infrahouse-github-backup2024100900462755050000000420241009004628273000000006"
        name                             = "infrahouse-github-backup2024100900462755050000000420241009004628273000000006"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "11" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.terraform-aws-github-backup.aws_launch_template.github-backup will be updated in-place
  ~ resource "aws_launch_template" "github-backup" {
        id                                   = "lt-05453df9000ac85e1"
      ~ image_id                             = "ami-0c64a34bf821b0cd1" -> "ami-05e1c8b4e753b29d3"
      ~ latest_version                       = 11 -> (known after apply)
        name                                 = "infrahouse-github-backup20241009004627550500000004"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vpn.data.aws_iam_policy_document.instance_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "instance_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:ModifyInstanceAttribute",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "openvpn-2024070518392010580000001e-nRBgZQ",
                ]
              + variable = "ec2:ResourceTag/aws:autoscaling:groupName"
            }
        }
    }

  # module.vpn.aws_autoscaling_group.openvpn will be updated in-place
  ~ resource "aws_autoscaling_group" "openvpn" {
        id                               = "openvpn-2024070518392010580000001e-nRBgZQ"
        name                             = "openvpn-2024070518392010580000001e-nRBgZQ"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "12" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.vpn.aws_launch_template.openvpn will be updated in-place
  ~ resource "aws_launch_template" "openvpn" {
        id                                   = "lt-0f7a032c61f3f5094"
      ~ image_id                             = "ami-0c64a34bf821b0cd1" -> "ami-05e1c8b4e753b29d3"
      ~ latest_version                       = 12 -> (known after apply)
        name                                 = "openvpn-2024070518392010580000001e"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
            "environment"       = "development"
            "service"           = "openvpn"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.jumphost.module.jumphost_userdata.data.cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (sensitive value)
          + content_type = "text/cloud-config"
        }
    }

  # module.vpn.module.instance_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/openvpn-8u1hU4OyuQDT20240705183937201200000024"
        name             = "openvpn-8u1hU4OyuQDT20240705183937201200000024"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:GetCallerIdentity"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "ec2:ModifyInstanceAttribute"
                      - Condition = {
                          - StringEquals = {
                              - "ec2:ResourceTag/aws:autoscaling:groupName" = "openvpn-2024070518392010580000001e-nRBgZQ"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openvp2024070518391750040000001b"
        name                             = "openvp2024070518391750040000001b"
        # (32 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "17" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (12 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0ef83181fbf251354"
      ~ image_id                             = "ami-0c91eccbf5507ede1" -> "ami-0509eb4a380d8a316"
      ~ latest_version                       = 17 -> (known after apply)
        name                                 = "openvp20240705183917137600000019"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 13 to change, 1 to destroy.

Warning: Invalid Attribute Combination

  with module.management.aws_s3_bucket_lifecycle_configuration.vpc_flow_logs,
  on .terraform/modules/management/vpc_flow_logs.tf line 51, in resource "aws_s3_bucket_lifecycle_configuration" "vpc_flow_logs":
  51:     filter {}

No attribute specified when one (and only one) of
[rule[0].filter[0].prefix.<.object_size_greater_than,rule[0].filter[0].prefix.<.object_size_less_than,rule[0].filter[0].prefix.<.and,rule[0].filter[0].prefix.<.tag]
is required

This will be an error in a future version of the provider

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDMsICJjaGFuZ2UiOiAxMywgImRlc3Ryb3kiOiAxfX0=
```
</details>